import unittest
import Equalizer

L1 = ['заявката', 'заявката', 'заявката', 'заявката', 'заявката', 'заявката']
L2 = ['заявката', 'заявьата', 'завякатва', 'заявкатаа', 'вя', 'язвката']
Ops = [[('з', 'з'), ('а', 'а'), ('я', 'я'), ('в', 'в'), ('к', 'к'), ('а', 'а'), ('т', 'т'), ('а', 'а')],
       [('з', 'з'), ('а', 'а'), ('я', 'я'), ('в', 'в'), ('к', 'ь'), ('а', 'а'), ('т', 'т'), ('а', 'а')],
       [('з', 'з'), ('а', 'а'), ('яв', 'вя'), ('к', 'к'), ('а', 'а'), ('т', 'т'), ('', 'в'), ('а', 'а')],
       [('з', 'з'), ('а', 'а'), ('я', 'я'), ('в', 'в'), ('к', 'к'), ('а', 'а'), ('т', 'т'), ('', 'а'), ('а', 'а')]]


class EqualizerTest(unittest.TestCase):

    def test_editOperations(self):
        for s1, s2, o in zip(L1, L2, Ops):
            self.assertEqual(Equalizer.editOperations(s1, s2), o)


if __name__ == '__main__':
    unittest.main()
